id: 65b68c1a-e1a6-4e41-a0da-a7f44db8c7dc
name: NSG inbound allow any-to-any rule created or updated
kind: Scheduled
description: |
  'Detects creation or update of an NSG rule that broadly allows inbound traffic from any source to any destination on any port. This is a high-risk misconfiguration that can expose workloads directly to the internet and enable initial access.'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1190
query: |
  let queryFrequency = 15m;
  AzureActivity
  | where ingestion_time() > ago(queryFrequency)
  | where ActivityStatusValue =~ "Success"
  | where tolower(OperationNameValue) has "microsoft.network/networksecuritygroups" and tolower(OperationNameValue) endswith "/securityrules/write"
  | extend requestBody = tostring(parse_json(Properties).requestbody)
  | extend request = parse_json(requestBody)
  | extend ruleProps = coalesce(request.properties, request.Properties)
  | extend Access = tostring(ruleProps.access), Direction = tostring(ruleProps.direction), Protocol = tostring(ruleProps.protocol)
  | extend SourcePrefix = tostring(ruleProps.sourceAddressPrefix), SourcePrefixes = tostring(ruleProps.sourceAddressPrefixes)
  | extend DestPrefix = tostring(ruleProps.destinationAddressPrefix), DestPrefixes = tostring(ruleProps.destinationAddressPrefixes)
  | extend DestPort = tostring(ruleProps.destinationPortRange), DestPorts = tostring(ruleProps.destinationPortRanges)
  | extend DestPortsCombined = iff(isnotempty(DestPorts), DestPorts, DestPort)
  | extend SourceAny = (SourcePrefix in~ ("*", "Internet", "0.0.0.0/0", "::/0"))
      or (SourcePrefixes has "0.0.0.0/0") or (SourcePrefixes has "\"Internet\"") or (SourcePrefixes has "*")
  | extend DestAny = (DestPrefix in~ ("*", "0.0.0.0/0", "::/0"))
      or (DestPrefixes has "0.0.0.0/0") or (DestPrefixes has "*")
  | extend PortAny = DestPortsCombined == "*" or DestPortsCombined has "1-65535" or DestPortsCombined has "0-65535"
  | extend ProtoAny = Protocol in~ ("*", "Any")
  | where Direction =~ "Inbound" and Access =~ "Allow" and SourceAny and DestAny and PortAny and ProtoAny
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])
  | project TimeGenerated, Caller, Name, UPNSuffix, CallerIpAddress, OperationNameValue, ResourceGroup, _ResourceId, Resource, CorrelationId, Access, Direction, Protocol, SourcePrefix, DestPrefix, DestPortsCombined
entityMappings:
  - entityType: AzureResource
    fieldMappings:
      - identifier: ResourceId
        columnName: _ResourceId
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Caller
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
customDetails:
  NSGResourceId: _ResourceId
  RuleName: Resource
  Source: SourcePrefix
  Destination: DestPrefix
  Ports: DestPortsCombined
alertDetailsOverride:
  alertDisplayNameFormat: |
    NSG rule allows inbound any-to-any on all ports
  alertDescriptionFormat: |
    A Network Security Group (NSG) security rule was created or updated to allow inbound traffic from any source to any destination on any port.

    Actor: {{Caller}}
    Source IP: {{CallerIpAddress}}
    NSG: {{NSGResourceId}}
    Rule: {{RuleName}}
    Source: {{Source}}
    Destination: {{Destination}}
    Ports: {{Ports}}
version: 1.0.0
